In [34]:
import numpy as np
import pandas as pd
V1 = np.array([1,3,6, np.nan, 7, 1, np.nan, 9,15])
V2 = np.array([7, np.nan,5,8,12, np.nan, np.nan,2,3])
V3 = np.array([np.nan, 12,5,6,14,7, np.nan,2,31])
V4 = np.array(["IT", np.nan,"HR","HR","IT","IT","HR","IT","IT"], dtype="object")
df = pd.DataFrame(
{"salary": V1,
"V2" : V2,
"V3": V3,
"department" : V4}
)
df

   salary    V2    V3 department
0     1.0   7.0   NaN         IT
1     3.0   NaN  12.0        NaN
2     6.0   5.0   5.0         HR
3     NaN   8.0   6.0         HR
4     7.0  12.0  14.0         IT
5     1.0   NaN   7.0         IT
6     NaN   NaN   NaN         HR
7     9.0   2.0   2.0         IT
8    15.0   3.0  31.0         IT

In [35]:
df.groupby("department")["salary"].mean()

department
HR    6.0
IT    6.6
Name: salary, dtype: float64

In [36]:
df["salary"].fillna(df.groupby("department")["salary"].transform("mean"))

0     1.0
1     3.0
2     6.0
3     6.0
4     7.0
5     1.0
6     6.0
7     9.0
8    15.0
Name: salary, dtype: float64

In [37]:
df["department"].mode()

0    IT
Name: department, dtype: object

In [38]:
df["department"].mode()[0]

'IT'

In [39]:
df["department"].fillna(df["department"].mode()[0])

0    IT
1    IT
2    HR
3    HR
4    IT
5    IT
6    HR
7    IT
8    IT
Name: department, dtype: object

In [40]:
df["department"].bfill()

0    IT
1    HR
2    HR
3    HR
4    IT
5    IT
6    HR
7    IT
8    IT
Name: department, dtype: object

In [41]:
df["department"].ffill()

0    IT
1    IT
2    HR
3    HR
4    IT
5    IT
6    HR
7    IT
8    IT
Name: department, dtype: object